Model: "model_full"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_2 (InputLayer)            [(None, 64, 64, 3)]  0
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 64, 64, 3)]  0
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 64, 64, 3)]  0
__________________________________________________________________________________________________
model (Functional)              (None, 512)          35536       input_2[0][0]
                                                                 input_3[0][0]
                                                                 input_4[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1536)         0           model[0][0]
                                                                 model[1][0]
                                                                 model[2][0]
__________________________________________________________________________________________________
W1 (Dense)                      (None, 12)           18444       concatenate[0][0]
__________________________________________________________________________________________________
age (Dense)                     (None, 1)            13          W1[0][0]
==================================================================================================
Total params: 53,993
Trainable params: 53,737
Non-trainable params: 256
__________________________________________________________________________________________________
None



Model: "model_no_context"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_6 (InputLayer)         [(None, 64, 64, 3)]       0
_________________________________________________________________
model_1 (Functional)         (None, 512)               35536
_________________________________________________________________
W1 (Dense)                   (None, 12)                6156
_________________________________________________________________
age (Dense)                  (None, 1)                 13
=================================================================
Total params: 41,705
Trainable params: 41,449
Non-trainable params: 256
_________________________________________________________________
None




Model: "model_no_cascade"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_2 (InputLayer)            [(None, 64, 64, 3)]  0
__________________________________________________________________________________________________
input_3 (InputLayer)            [(None, 64, 64, 3)]  0
__________________________________________________________________________________________________
input_4 (InputLayer)            [(None, 64, 64, 3)]  0
__________________________________________________________________________________________________
model (Functional)              (None, 512)          35536       input_2[0][0]
                                                                 input_3[0][0]
                                                                 input_4[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 1536)         0           model[0][0]
                                                                 model[1][0]
                                                                 model[2][0]
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 16)           24592       concatenate[0][0]
__________________________________________________________________________________________________
age (Dense)                     (None, 1)            17          dense_10[0][0]
==================================================================================================
Total params: 60,145
Trainable params: 59,889
Non-trainable params: 256
__________________________________________________________________________________________________
None




Model: "model_no_nothing"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_12 (InputLayer)        [(None, 64, 64, 3)]       0
_________________________________________________________________
model_3 (Functional)         (None, 512)               35536
_________________________________________________________________
dense_41 (Dense)             (None, 32)                16416
_________________________________________________________________
age (Dense)                  (None, 1)                 33
=================================================================
Total params: 51,985
Trainable params: 51,729
Non-trainable params: 256
_________________________________________________________________
None